In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("main.csv")

In [5]:
df

          day  temperature  windspeed  event
0  01-01-2017           32          6   Rain
1  01-02-2018           35          7  Sunny
2  01-03-2019           28          2   Snow
3  01-04-2016           24          7   Snow
4  01-05-2017           32          4   Rain
5  01-06-2020           31          2  Sunny

In [8]:
df=pd.read_excel("main.xlsx","main")

In [9]:
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2018-02-01           35          7  Sunny
2 2019-03-01           28          2   Snow
3 2016-04-01           24          7   Snow
4 2017-05-01           32          4   Rain
5 2020-06-01           31          2  Sunny

In [13]:
chirag={
'name':['chb','dhb','hkb'],
'age':[31,30,58],
'job':['private','gov','semi_gov'],
'city':['kadi','kalol','ahmedabad']

}

In [14]:
df=pd.DataFrame(chirag)

In [15]:
df

  name  age       job       city
0  chb   31   private       kadi
1  dhb   30       gov      kalol
2  hkb   58  semi_gov  ahmedabad

In [16]:


chirag1=[
('1/2/2019',32,6,'rain'),
('1/3/2018',34,7,'sunny'),
('1/4/2017',28,2,'snow')
]

In [17]:
df=pd.DataFrame(chirag1,columns=('days','temp','speed','event'))

In [18]:
df

       days  temp  speed  event
0  1/2/2019    32      6   rain
1  1/3/2018    34      7  sunny
2  1/4/2017    28      2   snow